// Console.WriteLine("Введи число: ");
// int num1 = int.Parse(Console.ReadLine()!);
// Console.WriteLine("Введи число: ");
// int num2 = int.Parse(Console.ReadLine()!);
// if (num1 > num2) 
// 	{Console.WriteLine($"Большее число {num1}, меньшее число {num2}");}
//     else if (num2 > num1)
// 		{Console.WriteLine($"Большее число {num2}, меньшее число {num1}");}

//2 задача 1 семинара
// Console.WriteLine("Введи число: ");
// int num1 = int.Parse(Console.ReadLine()!);
// Console.WriteLine("Введи число: ");
// int num2 = int.Parse(Console.ReadLine()!);
// Console.WriteLine("Введи число: ");
// int num3 = int.Parse(Console.ReadLine()!);
// int max = num1;
// if (max < num2) {
//     max = num2;
// }
// if (max < num3) {
//     max = num3;
// }
// Console.WriteLine ($"Число {max} является максимальным");

// Задача 3 семинара 1
// Напишите программу, которая на вход принимает число и выдаёт
// является ли число чётным (делится ли оно на два без остатка).

Console.WriteLine("Введи число: ");
int a = int.Parse(Console.ReadLine()!);
  if (a % 2==1)
    {Console.WriteLine("число нечетное");}
    else
        {Console.WriteLine("Число четное");
        }

// Задача 4 семинар 1
//Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N

